app/controllers/api/users_controller.rb

      def create
        if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "auth_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

      def update
        if @user.update(user_params)
---
UPDATE "users" SET "email" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "ronnie.lol@email.com"], ["encrypted_password", "$2a$10$HRA0hQ6HFmsVA7jsQSu71uPvmBsN3Bq..NotdIHdguXcRMSInfqx."], ["updated_at", "2015-04-11 21:54:16.325136"], ["id", 3]]